package com.example.remembrance;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;

import java.util.ArrayList;

public class MainRemembrancesForHajjAndUmrahActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_remembrances_for_hajj_and_umrah);
        RecyclerView view12=findViewById(R.id.view11);
        ImageView i12=findViewById(R.id.i12);
        i12.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                startActivity(new Intent(getApplicationContext(),MainInterfaceActivity.class));
            }
        });

        ArrayList<item> data12=new ArrayList<>();
        data12.add(new item("قد ربط الله تعالى بين الحج والذكر فجعله من أهم مقاصد الركن الخامس من أركان الدين، قال تعالى :\n" +
                "\n" +
                "\"واذكروا الله في أيام معدودات \". [سورة البقرة - الآية 203]\n" +
                "وقال تعالى :\n" +
                "\n" +
                "\"وأذن في الناس بالحج يأتوك رجالا وعلى كل ضامر يأتين من كل فج عميق ﴿27﴾ ليشهدوا منافع لهم ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام\". [سورة الحج - الآية 28]\n" +
                "فجعل من أهم مقاصد الحج أن يقوم العبد بذكر الله وشكره.\n" +
                "\n" +
                "وأكد النبي صلى الله عليه وسلم ارتباط الحج بذكر الله فقال صلى الله عليه وسلم:\n" +
                "\n" +
                "\" إنما جعل الطواف بالبيت وبين الصفا والمروة ورمي الجمار لإقامة ذكر الله\". [رواه أبو داود والترمذي]\n" +
                "وهكذا يتجلى شأن الذكر في الحج، ويستبين عظم منزلته ورفيع مكانته. وفيما يلي الأدعية النبوية والأذكار الواردة في محطات الحج ومواقيته الزمانية والمكانية والعمرة والزيارة فاحفظها ليكون حجك مبرورا وسعيك مشكورا."));
        data12.add(new item("الذكر عند الاحرام\n" +
                "\"سبحان الله والحمد لله والله أكبر\"\n" +
                "دعاء التلبية في الحج والعمرة\n" +
                "\"لبيك اللهم لبيك، لبيك لا شريك لك لبيك إن الحمد، والنعمة، لك والملك، لا شريك لك\".  [البخاري (2/ 170)، ومسلم (1184)]\n" +
                "الدعاء عند رؤية الكعبة\n" +
                "\"اللهم أنت السلام ومنك السلام، فحينا ربنا بالسلام\". [أبي شيبة 7/ 102، والبيهقي 5/ 73]\n" +
                "الدعاء عند استلام الحجر الأسود\n" +
                "\"باسم الله والله أكبر\". [الطبراني (862)، (863)، والبيهقي (5/ 79)]\n" +
                "\"لا إله إلا الله والله أكبر، اللهم تصديقا بكتابك، وسنة نبيك صلى الله عليه وسلم\". [الطبراني (865)]\n" +
                "الدعاء بين الركن اليماني والحجر الأسود\n" +
                "\"ربنا آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار\". [أبو داود 2/179 وأحمد 3/411]\n" +
                "الدعاء في الطواف\n" +
                "\"اللهم ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار\". [الطبراني (857)، والبيهقي (5/ 84)]\n" +
                "\"لا إله إلا الله وحده، لا شريك له، له الملك وله الحمد، بيده الخير، وهو على كل شيء قدير\".\n" +
                "الدعاء بعد ركعتي الطواف\n" +
                "اللهم اعصمني بدينك، وطاعة رسولك صلى الله عليه وسلم.\n" +
                "اللهم جنبني حدودك.\n" +
                "اللهم اجعلني ممن يحبك، ويحب ملائكتك، ورسلك، وعبادك الصالحين اللهم حببني إليك، وإلى ملائكتك، ورسلك، وعبادك الصالحين.\n" +
                "اللهم آتني من خير ما تؤتي عبادك الصالحين في الدنيا والآخرة.\n" +
                "اللهم يسرني لليسرى، وجنبني العسرى، واغفر.\n" +
                "الدعاء عند صعود الصفا والمروة\n" +
                "عن جابر بن عبد الله رضي الله عنه، قال: سمعت رسول الله صلى الله عليه وسلم حين خرج من المسجد يريد الصفا، يقول: \"نبدأ بما بدأ به\" فبدأ بالصفا، وقرأ: {إن الصفا والمروة من شعائر الله} وكان إذا وقف على الصفا يكبر ثلاثا، ويقول:\n" +
                "\"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا إله إلا الله، أنجز وعده، ونصر عبده، وهزم الأحزاب وحده\".\n" +
                "ثم أعاد هذا الكلام. [مسلم (1218)، وأحمد (3/ 320، 321)]\n" +
                "الدعاء على الصفا\n" +
                "\"اللهم إنك قلت: {ادعوني أستجب لكم} وإنك لا تخلف الميعاد، وإني أسألك كما هديتني إلى الإسلام ألا تنزعه مني حتى تتوفاني، وأنا مسلم\".\n" +
                "\"اللهم اعصمنا بدينك، وطواعيتك، وطواعية رسولك، وجنبنا حدودك\".\n" +
                "\"اللهم اجعلنا نحبك، ونحب ملائكتك، وأنبياءك، ورسلك، ونحب عبادك الصالحين\".\n" +
                "\"اللهم حببنا إليك وإلى ملائكتك، وإلى أنبيائك، ورسلك، وإلى عبادك الصالحين\".\n" +
                "\"اللهم يسرنا لليسرى، وجنبنا وجنبنا العسرى، واغفر لنا في الآخرة\". [البيهقي (5/ 94)]\n" +
                "الدعاء في السعي بين الصفا والمروة\n" +
                "\"رب اغفر وارحم إنك أنت الأعز الأكرم\". [الطبراني (870)، والبيهقي (5/ 95)]\n" +
                "الدعاء بعرفات\n" +
                "\"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير\". [الترمذي (3579)، والطبراني (784)]\n" +
                "دعاء السلف الصالح في عرفات\n" +
                "\"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير\".\n" +
                "\"اللهم اهدنا بالهدى، وزينا بالتقوى، واغفر لنا في الآخرة والأولى\".\n" +
                "\"ثم يخفض صوته، ثم يقول: اللهم إني أسألك من فضلك وعطائك رزقا طيبا مباركا\".\n" +
                "\"اللهم إنك أمرت بالدعاء، وقضيت على نفسك بالاستجابة، وأنت لا تخلف وعدك، ولا تكذب عهدك، اللهم ما أحببت من خير فحببه إلينا، ويسره لنا، وما كرهت من شيء فكرهه إلينا وجنبناه، ولا تنزع عنا الإسلام بعد إذ أعطيتنا\".\n" +
                "الدعاء عند رمي جمرة العقبة عند كل حصاة\n" +
                "\"الله أكبر، الله أكبر، الله أكبر\".\n" +
                "\"اللهم اجعله حجا مبرورا وذنبا مغفورا\". [الطبراني (881)، والبيهقي (5/ 129)]\n" +
                "الذكر عند ذبح الأضاحي\n" +
                "بسم الله , اللهم تقبل من محمد وآل محمد ومن أمة محمد\n" +
                "دعاء الرجوع من الحج أو العمرة\n" +
                "\"الله أكبر، الله أكبر، الله أكبر\".\n" +
                "\"لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير، آيبون، تائبون، عابدون، ساجدون\".\n" +
                "\"اللٰهم اجعله حجا مبرورا وسعيا مشكورا وذنبا مغفورا\"."));


        Recycler recycler=new Recycler(this,data12);
        LinearLayoutManager manager1 =new LinearLayoutManager(this,LinearLayoutManager.VERTICAL,false);
        view12.setLayoutManager(manager1);
        view12.setAdapter(recycler);
    }
}