package com.example.remembrance;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;

import java.util.ArrayList;

public class MainRemembranceOfPrayerActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_remembrance_of_prayer);

        RecyclerView view5 = findViewById(R.id.view5);
        ImageView i4=findViewById(R.id.i4);
        i4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                startActivity(new Intent(getApplicationContext(),MainInterfaceActivity.class));
            }
        });
        ArrayList<item> data5 = new ArrayList<>();
        data5.add(new item("أدعية استفتاح الصلاة\n" +
                "اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي، بالثلج والماء والبرد.\n" +
                "سبحانك سبحانك اللهم وبحمدك، وتبارك اسمك، وتعالى جدك، ولا إله غيرك.\n" +
                "الحمد الحمد لله حمدا كثيرا طيبا مباركا فيه.\n" +
                "الله أكبر كبيرا، والحمد لله كثيرا، وسبحان الله بكرة واصيلا. أعوذ بالله من الشيطان: من نفخه، ونفثه، وهمزه.\n" +
                "اللهم رب جبرائيل، وميكائيل، وإسرافيل، فاطر السموات والأرض، عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون، اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم.\n" +
                "وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين، إن صلاتي، ونسكي، ومحياي، ومماتي لله رب العالمين، لا شريك له وبذلك أمرت وانا من المسلمين، اللهم أنت الملك لا إله إلا أنت، أنت ربي وأنا عبدك، ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت. واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت، واصرف عني سيئها، لا يصرف عني سيئها إلا أنت، لبيك وسعديك، والخير كله بيديك، والشر ليس إليك، أنا بك وإليك، تباركت وتعاليت، أستغفرك وأتوب إليك."));
        data5.add(new item("أدعية الركوع\n" +
                "سبحان ربي العظيم. ثلاث مرات أو أكثر.\n" +
                "سبحان ربي العظيم وبحمده. ثلاث مرات.\n" +
                "سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي.\n" +
                "سبوح، قدوس، رب الملائكة والروح.\n" +
                "سبحان ذي الجبروت، والملكوت، والكبرياء، والعظمة.\n" +
                "اللهم لك ركعت، وبك آمنت، ولك أسلمت، خشع لك سمعي وبصري، ومخي وعظمي وعصبي."));
        data5.add(new item("أدعية الرفع من الركوع\n" +
                "سمع الله لمن حمده.\n" +
                "ربنا ولك الحمد، حمدا كثيرا طيبا مباركا فيه.\n" +
                "اللهم لك ركعت، وبك آمنت، ولك اسلمت، خشع لك سمعي، و بصـري، ومخي، وعظمي، وعصبي، وما استقلت به قدمي لله رب العالمين.\n" +
                "اللهم ربنا لك الحمد ملء السماوات وملء الارض، وما بينهما، وملء ما شئت من شيء بعد، أهل الثناء والمجد، أحق ما قال العبد، وكلنا لك عبد، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد.\n" +
                "اللهم لك الحمد ملء السماء، وملء الارض، وملء ما شئت من شيء بعد، اللهم طهرني بالثلج والبرد، والماء البارد، اللهم طهرني من الذنوب والخطايا، كما ينقى الثوب الابيض من الوسخ."));
        data5.add(new item("أدعية السجود\n" +
                "سبحان ربي الأعلى. ثلاث مرات أو أكثر.\n" +
                "سبحان ربي الأعلى وبحمده. ثلاث مرات.\n" +
                "سبوح قدوس رب الملائكة والروح.\n" +
                "سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي.\n" +
                "سبحان ذي الجبروت والملكوت والكبرياء والعظمة.\n" +
                "اللهم اغفر لي ذنبي كله دقه وجله، وأوله وآخره، وعلانيته وسره.\n" +
                "اللهم لك سجدت وبك آمنت، ولك أسلمت، سجد وجهي للذي خلقه، وصوره، وشق سمعه وبصره، تبارك الله أحسن الخالقين.\n" +
                "اللهم إني أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصـي ثناء عليك، أنت كما أثنيت على نفسك.\n" +
                "رب اعط نفسي تقواها زكها أنت خير من زكاها أنت وليها ومولاها.\n" +
                "اللهم اجعل في قلبي نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من تحتي نورا واجعل من فوقي نورا وعن يميني نورا وعن يساري نورا واجعل أمامي نورا واجعل خلفي نورا وأعظم لي نورا."));
        data5.add(new item("أدعية الجلوس بين السجدتين\n" +
                "رب رب اغفر لي، رب اغفر لي.\n" +
                "اللهم اغفر لي، وارحمني، واهدني، واجبرني، وعافني، وارزقني، وارفعني.\n" +
                "كان النبي صلى الله عليه وسلم يطيل هذا الركن بقدر السجود."));
        data5.add(new item("دعاء سجود التلاوة\n" +
                "سجد وجهي للذي خلقه، وشق سمعه وبصره، بحوله وقوته، فتبارك الله أحسن الـخالقين.\n" +
                "اللهم اكتب لي بها عندك أجرا، وضع عني بها وزرا، واجعلها لي عندك ذخرا، وتقبلها مني كما تقبلتها من عبدك داود."));
        data5.add(new item("التشهد الأول\n" +
                "التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين ، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله."));
        data5.add(new item("التشهد الأخير\n" +
                "التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين ، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله. اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد ، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد."));
        data5.add(new item("أدعية بعد التشهد الأخير وقبل السلام\n" +
                "اللهم إني أعوذ بك من عذاب القبر، ومن عذاب جهنم، ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال.\n" +
                "اللهم إني أعوذ بك من عذاب القبر. وأعوذ بك من فتنة المسيح الدجال. وأعوذ بك من فتنة المحيا والممات. اللهم إني أعوذ بك من المأثم والمغرم ."));


        Recycler recycler = new Recycler(this, data5);
        LinearLayoutManager manager1 = new LinearLayoutManager(this, LinearLayoutManager.VERTICAL, false);
        view5.setLayoutManager(manager1);
        view5.setAdapter(recycler);
    }
}