package com.example.remembrance;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;

import java.util.ArrayList;

public class MainRoquiaActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_roquia);
        RecyclerView view10=findViewById(R.id.view10);
        ImageView i11=findViewById(R.id.i11);
        i11.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                startActivity(new Intent(getApplicationContext(),MainInterfaceActivity.class));
            }
        });
        ArrayList<item> data10=new ArrayList<>();
        data10.add(new item("الرقية الشرعية من القرآن الكريم\n" +
                "* بسم الله الرحمن الرحيم ﴿1﴾ الحمد لله رب العالمين ﴿2﴾ الرحمن الرحيم ﴿3﴾ مالك يوم الدين ﴿4﴾ إياك نعبد وإياك نستعين ﴿5﴾ اهدنا الصراط المستقيم ﴿6﴾ صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين ﴿7﴾. [الفاتحة: 1-7]\n" +
                "* الم ﴿1﴾ ذلك الكتاب لا ريب فيه هدى للمتقين ﴿2﴾ الذين يؤمنون بالغيب ويقيمون الصلاة ومما رزقناهم ينفقون ﴿3﴾ والذين يؤمنون بما أنزل إليك وما أنزل من قبلك وبالآخرة هم يوقنون ﴿4﴾ أولئك على هدى من ربهم وأولئك هم المفلحون ﴿5﴾. [البقرة: 1-5]\n" +
                "* الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]\n" +
                "* لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير ﴿284﴾ آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ﴿285﴾ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين ﴿286﴾. [البقرة: 284-286]\n" +
                "* قل يا أيها الكافرون ﴿1﴾ لا أعبد ما تعبدون ﴿2﴾ ولا أنتم عابدون ما أعبد ﴿3﴾ ولا أنا عابد ما عبدتم ﴿4﴾ ولا أنتم عابدون ما أعبد ﴿5﴾ لكم دينكم ولي دين ﴿6﴾. [الكافرون]\n" +
                "* قل هو الله أحد ﴿1﴾ الله الصمد ﴿2﴾ لم يلد ولم يولد ﴿3﴾ ولم يكن له كفوا أحد ﴿4﴾. [الإخلاص]\n" +
                "* قل أعوذ برب الفلق ﴿1﴾ من شر ما خلق ﴿2﴾ ومن شر غاسق إذا وقب ﴿3﴾ ومن شر النفاثات في العقد ﴿4﴾ ومن شر حاسد إذا حسد ﴿5﴾. [الفلق]\n" +
                "* قل أعوذ برب الناس ﴿1﴾ ملك الناس ﴿2﴾ إله الناس ﴿3﴾ من شر الوسواس الخناس ﴿4﴾ الذي يوسوس في صدور الناس ﴿5﴾ من الجنة والناس ﴿6﴾. [الناس]\n" +
                "\n" +
                "\n" +
                "\n" +
                "الرقية الشرعية من السنة النبوية\n" +
                "* أعوذ بالله العظيم، وبوجهه الكريم، وسلطانه القديم، من الشيطان الرجيم.\n" +
                "* أعوذ بالله من الشيطان الرجيم، من همزه ونفخه ونفثه.\n" +
                "* أعوذ بكلمات الله التامة ، من كل شيطان وهامة ، ومن كل عين لامة.\n" +
                "* أعوذ بكلمات الله التامات من شر ما خلق.\n" +
                "* بسم الله أرقيك، من كل شيء يؤذيك، من شر كل نفس أو عين حاسد، الله يشفيك، بسم الله أرقيك.\n" +
                "* بسم الله (ثلاثا)، أعوذ بالله وقدرته من شر ما أجد وأحاذر (سبع مرات).\n" +
                "* أسأل الله العظيم رب العرش العظيم، أن يعافيك ويشفيك.\n" +
                "* اللهم رب الناس، أذهب البأس، واشف، أنت الشافي لا شفاء إلا شفاؤك، شفاء لا يغادر سقما.\n" +
                "* اللهم اشف عبدك، وصدق رسولك.\n" +
                "* اللهم بارك عليه، وأذهب عنه حر العين وبردها ووصبها.\n" +
                "* اللهم إنا نسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم ونعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم وأنت المستعان، وعليك البلاغ، ولا حول ولا قوة إلا بالله.\n" +
                "* لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش الكريم، لا إله إلا الله رب السماوات ورب العرش العظيم.\n" +
                "* ربنا الله الذي في السماء، تقدس اسمك، أمرك في السماء والأرض، كما رحمتك في السماء فاجعل رحمتك في الأرض، اغفر لنا حوبنا وخطايانا، أنت رب الطيبين، أنزل رحمة من رحمتك، وشفاء من شفائك على هذا الوجع، فيبرأ. (ثلاث مرات).\n" +
                "* أعوذ بوجه الله الكريم، وبكلمات الله التامات، اللاتي لا يجاوزهن بر ولا فاجر، من شر ما ينزل من السماء وشر ما يعرج فيها، وشر ما ذرأ في الأرض وشر ما يخرج منها، ومن فتن الليل والنهار، ومن طوارق الليل والنهار، إلا طارقا يطرق بخير يا رحمن .\n" +
                "* بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. (ثلاث مرات).\n" +
                "* أعوذ بكلمات الله التامة من غضبه وعقابه ، وشر عباده ، ومن همزات الشياطين ، وأن يحضرون.\n" +
                "* بسم الله العظيم ، أعوذ بالله الكبير من شر كل عرق نعار ، ومن شر حر النار.\n" +
                "* بسم الله تربة أرضنا، بريقة بعضنا، يشفى سقيمنا، بإذن ربنا.\n" +
                "* اللهم إني أسألك بأن لك الحمد لا إله إلا أنت، المنان يا بديع السماوات والأرض، يا ذا الجلال والإكرام، يا حي يا قيوم.\n" +
                "* اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت، الأحد، الصمد، الذي لم يلد، ولم يولد، ولم يكن له كفوا أحد.\n" +
                "* أسأل الله العظيم رب العرش العظيم، أن يعافيك ويشفيك. (سبع مرات).\n" +
                "* اللهم برد قلبي بالثلج والبرد والماء البارد ، اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس.\n" +
                "* اللهم إني أعوذ بوجهك الكريم وكلماتك التامة من شر ما أنت آخذ بناصيته، اللهم أنت تكشف المغرم والمأثم، اللهم لا يهزم جندك، ولا يخلف وعدك، ولا ينفع ذا الجد منك الجد، سبحانك وبحمدك.\n" +
                "* باسم الله يبريك، ومن كل داء يشفيك، ومن شر حاسد إذا حسد، وشر كل ذي عين.\n" +
                "* اللهم اشف عبدك ينكأ لك عدوا ، أو يمشي لك إلى صلاة.\n" +
                "* اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم في العالمين إنك حميد مجيد."));

        Recycler recycler=new Recycler(this,data10);
        LinearLayoutManager manager1 =new LinearLayoutManager(this,LinearLayoutManager.VERTICAL,false);
        view10.setLayoutManager(manager1);
        view10.setAdapter(recycler);
    }
}